src_doc/Catalogs/СобытияОбновленияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СобытияОбновленияЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВытесняемыеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВытесняемоеСобытие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияОбновленияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/Catalogs/СобытияОбновленияЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	СобытиеОбновленияЗадачиОбъект = ЗарегистрированОтветныйДокумент.ПолучитьОбъект();
	СобытиеОбновленияЗадачиОбъект.Наименование = НСтр("ru = 'Зарегистрирован ответный документ'");
	СобытиеОбновленияЗадачиОбъект.Описание = НСтр("ru = 'Зарегистрирован исходящий'");
	СтрокаВытесняемогоСобытия = СобытиеОбновленияЗадачиОбъект.ВытесняемыеСобытия.Добавить();
	СтрокаВытесняемогоСобытия.ВытесняемоеСобытие = СозданОтветныйДокумент;
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СобытиеОбновленияЗадачиОбъект);
	
	СобытиеОбновленияЗадачиОбъект = ИсполненаЗадачаОтветственногоИсполнителя.ПолучитьОбъект();
	СобытиеОбновленияЗадачиОбъект.Наименование = НСтр("ru = 'Исполнена задача ответственного исполнителя'");
	СобытиеОбновленияЗадачиОбъект.Описание = НСтр("ru = 'Ответственный исполнитель закрыл свою задачу'");
	СтрокаВытесняемогоСобытия = СобытиеОбновленияЗадачиОбъект.ВытесняемыеСобытия.Добавить();
	СтрокаВытесняемогоСобытия.ВытесняемоеСобытие = ИсполненаЗадачаСоисполнителя;
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СобытиеОбновленияЗадачиОбъект);
	
	СобытиеОбновленияЗадачиОбъект = ИсполненаЗадачаСоисполнителя.ПолучитьОбъект();
	СобытиеОбновленияЗадачиОбъект.Наименование = НСтр("ru = 'Исполнена задача соисполнителя'");
	СобытиеОбновленияЗадачиОбъект.Описание = НСтр("ru = 'Соисполнитель закрыл свою задачу'");
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СобытиеОбновленияЗадачиОбъект);
	
	СобытиеОбновленияЗадачиОбъект = ИсполненаПодзадача.ПолучитьОбъект();
	СобытиеОбновленияЗадачиОбъект.Наименование = НСтр("ru = 'Исполнена подзадача'");
	СобытиеОбновленияЗадачиОбъект.Описание = НСтр("ru = 'Есть исполненные подзадачи'");
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СобытиеОбновленияЗадачиОбъект);
	
	СобытиеОбновленияЗадачиОбъект = СозданОтветныйДокумент.ПолучитьОбъект();
	СобытиеОбновленияЗадачиОбъект.Наименование = НСтр("ru = 'Создан ответный документ'");
	СобытиеОбновленияЗадачиОбъект.Описание = НСтр("ru = 'Исходящий не зарегистрирован'");
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СобытиеОбновленияЗадачиОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, 
    Параметры, СтандартнаяОбработка, Метаданные.Справочники.СобытияОбновленияЗадач);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
